## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.scan_files_api will be updated in-place
  ~ resource "aws_cloudfront_distribution" "scan_files_api" {
        id                             = "EI4T979V99J61"
        tags                           = {
            "CostCentre" = "scan-files-production"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)



      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "/healthcheck"
          + response_headers_policy_id = "12985cc0-d422-4ee5-844b-74125f0c6c19"
          + target_origin_id           = "scan-files-api"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }



        # (5 unchanged blocks hidden)
    }

  # aws_route53_health_check.scan_files_A will be created
  + resource "aws_route53_health_check" "scan_files_A" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 5
      + fqdn              = "scan-files.alpha.canada.ca"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + request_interval  = 30
      + resource_path     = "/healthcheck"
      + tags              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + type              = "HTTPS"
    }

  # aws_route53_record.scan_files_A will be updated in-place
  ~ resource "aws_route53_record" "scan_files_A" {
        id      = "Z09208862AM3U6FRXOHM8_scan-files.alpha.canada.ca_A"
        name    = "scan-files.alpha.canada.ca"
        # (5 unchanged attributes hidden)

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d2exqv3rgrnby5.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
      + alias {
          + evaluate_target_health = true
          + name                   = "d2exqv3rgrnby5.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
